#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками Расход
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
	Для Каждого ТекСтрокаКВыплате Из Выплаты Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = МоментВремени().Дата;
		Движение.Сотрудник = ТекСтрокаКВыплате.Сотрудник;
		Движение.Подразделение = ТекСтрокаКВыплате.Подразделение;
		Движение.Сумма = ТекСтрокаКВыплате.Сумма;   
		
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#КонецЕсли