#Область СлужебныеПроцедурыИФункции

Функция СоздатьРеализации (НачалоПериода, КонецПериода) Экспорт
	МассивВозврат = Новый Массив;
	
	СозданныеРеализации = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачала
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|		И РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачалаПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончанияПериода,
	|			МЕСЯЦ)
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И (ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &ДатаОкончанияПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= &ДатаНачалаПериода)
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", 	Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецПериода);
	Запрос.УстановитьПараметр("ДатаНачалаПериода", НачалоПериода);
	
	ДоговорыВыборка = Запрос.Выполнить().Выгрузить();
	ВсегоДоговоров = ДоговорыВыборка.Количество();
	ТекущийДоговор = 1;
	
	Для каждого Договор из ДоговорыВыборка Цикл
		ДокументРеализацияОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокументРеализацияОбъект.Дата = НачалоПериода;
		ДокументРеализацияОбъект.Заполнить(Договор.Ссылка);
		ДокументРеализацияОбъект.ВыполнитьАвтозаполнение();
		ДокументРеализацияОбъект.ПроверитьЗаполнение();
		ДокументРеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);;

		ПроцентВыполнения = (ТекущийДоговор/ВсегоДоговоров)*100;
		ПроцентВыполнения = Окр (ПроцентВыполнения, 0);
		
		СозданныеРеализации.Вставить("Договор", Договор.Ссылка);
		СозданныеРеализации.Вставить("Реализация", ДокументРеализацияОбъект.Ссылка);
		
		МассивВозврат.Добавить(СозданныеРеализации);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(ДокументРеализацияОбъект.Ссылка));
		
		ТекущийДоговор = ТекущийДоговор + 1;
		
	КонецЦикла;

Возврат МассивВозврат;

КонецФункции
#КонецОбласти
