#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// регистр ВКМ_ПланГрафикаОтпусков
	Движения.ВКМ_ПланГрафикаОтпусков.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ПланГрафикаОтпусков.Добавить();
		Движение.Регистратор = Ссылка;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ДатаНачала = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпускаСотрудников.ДатаОкончания;
		Движение.Год = Год;
		Движение.Период = Дата;
		Движение.КоличествоДней = (ТекСтрокаОтпускаСотрудников.ДатаОкончания - ТекСтрокаОтпускаСотрудников.ДатаНачала) / (60 * 60 * 24) + 1;

		
	КонецЦикла;


КонецПроцедуры

#КонецОбласти

#КонецЕсли
