#Область ОбработчикиСобытийФормы

&НаСервере

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//получим из параметров вдрес врем.хран.
	//ранее в форме владельце вторым параметром передавали струтуру с адресом,
	//куда выгрузили таблчную часть  док.график отпусков
	//ПередаваемыеПараметры = Новый Структура ("АдресВремХранилища", АдресВремХранилища);;
	АдресВременногоХранилища = Параметры.АдресВремХранилища;
	
	//получим из врем.хранилища таблицу с графиком отпусков
	ТабличнаяЧастьОтпуска = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	//обойдем табличную часть
	
	Для Каждого Строка Из ТабличнаяЧастьОтпуска Цикл
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник, "Сотрудник");
		Точка.Текст = Строка.Сотрудник;
		
		Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла
	
КонецПроцедуры
#КонецОбласти
