#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СкрытьПоляДляАбонентскогоОбслживания();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьВидДоговораИУстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВидДоговораИУстановитьВидимость()
	Перем СправочникОбъект;
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	Если СправочникОбъект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ОтобразитьПоляДляАбонентскогоОбслживания();
	Иначе
		СкрытьПоляДляАбонентскогоОбслживания();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ОтобразитьПоляДляАбонентскогоОбслживания();
	Иначе
		СкрытьПоляДляАбонентскогоОбслживания();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОтобразитьПоляДляАбонентскогоОбслживания()
	Элементы.ВКМ_АбонентскоеОбслуживание.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СкрытьПоляДляАбонентскогоОбслживания()
	Элементы.ВКМ_АбонентскоеОбслуживание.Видимость = Ложь;
КонецПроцедуры
#КонецОбласти
