#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение () Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ИдентификторГруппыДляОповещения.Значение КАК Chat_id,
		|	ВКМ_ТокенУправленияТГБотом.Значение КАК TokenTG,
		|	ВКМ_УведомленияТГБот.Ссылка,
		|	ВКМ_УведомленияТГБот.Текст
		|ИЗ
		|	Константа.ВКМ_ТокенУправленияТГБотом КАК ВКМ_ТокенУправленияТГБотом,
		|	Константа.ВКМ_ИдентификторГруппыДляОповещения КАК ВКМ_ИдентификторГруппыДляОповещения,
		|	Справочник.ВКМ_УведомленияТГБот КАК ВКМ_УведомленияТГБот";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Пока Выборка.Следующий () Цикл
		TokenTG = Выборка.TokenTG;
		Chat_id = Выборка.Chat_id;
		
		Результат = ОтправкаЗаявкиТГ(Выборка.Текст, TokenTG, Chat_id);
			Если Результат Тогда
				Объект = Выборка.Ссылка.ПолучитьОбъект();
				Объект.Удалить();
			КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправкаЗаявкиТГ (Текст, Токен, ЧатИД)
		
		АдресТГ = "api.telegram.org";
		Соединение  =  Новый HTTPСоединение(АдресТГ,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		
		Данные = Новый Структура();
		Данные.Вставить("text", Текст);
		
				
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку(ПараметрыЗаписи);
		ЗаписатьJSON(Запись, Данные);
		СтрокаJSON = Запись.Закрыть();
		
		Заголовки = Новый Соответствие();
		Заголовки.Вставить("Content-Type", "application/json");
		АдресЗапроса = "bot" + Токен + "/sendMessage?chat_id=" + Формат(ЧатИД, "ЧГ=");
		
		Запрос = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Результат = Соединение.ОтправитьДляОбработки(Запрос);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Если Результат.КодСостояния = 200 Тогда
			Возврат Истина;
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецФункции

#КонецОбласти
#КонецЕсли